Autodesk.Navisworks.Api.TextFontInfo
Information about a text font. Immutable.

Autodesk.Navisworks.Api.TextFontInfo.#ctor
Creates an empty font info object.

Autodesk.Navisworks.Api.TextFontInfo.#ctor(System.String,System.Int32,System.Int32,System.Boolean,System.Boolean)
Creates a new font info object.

Autodesk.Navisworks.Api.TextFontInfo.Equals(System.Object)
Determines whether the specified object and the current object refer to the same
underlying native object. Returns false if either object has been disposed.

Autodesk.Navisworks.Api.TextFontInfo.GetHashCode
Serves as a hash function for a particular type.  is suitable for use in hashing algorithms and data structures like a hash table.
Returns: A hash code for the current .

Autodesk.Navisworks.Api.TextFontInfo.IsReadOnly
Gets a value indicating whether the object is read-only.

Autodesk.Navisworks.Api.TextFontInfo.Italic
Italics
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.TextFontInfo.PointSize
Font size in points
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.TextFontInfo.Strikeout
Strikeout
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.TextFontInfo.ToString
Returns a  that represents the current .
Returns: A  that represents the current .

Autodesk.Navisworks.Api.TextFontInfo.Typeface
Font typeface
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.TextFontInfo.Weight
Font weight
Throws System.ObjectDisposedException:
Object has been Disposed